{"pageProps":{"data":[{"id":1,"name":"Humanoid","poster":"https://drive.google.com/file/d/1rZYv7lo8nb8X7RcvsIihNhdB0_WCTlNK/view?usp=sharing","description":"Basically humanoid is a robot that resembles a human . Basically it was made as a project by the club to ease the tasks of humans by making the robot do the tasks! This robot had 28 servo motors which were fixed at the joints of the robot to enable their movements which were also controlled by the Arduino.  Such robots will definitely be in a huge demand in the future to perform repetitive tasks or general tasks more efficiently than the humans !","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.611Z","created_at":"2021-08-03T18:18:26.773Z","updated_at":"2021-08-03T18:18:26.773Z","star":"A human resembling robot that is programmed to perform various tasks and movements."},{"id":2,"name":"Chimney Climber","poster":"https://drive.google.com/file/d/1jczfXR32Dxx-UTGARMMr-eBJNazelIOQ/view?usp=sharing","description":"the task of this robot is similar to the name given to it, i.e. it is designed to climb two parallel walls mechanically. To attain grip on the walls to avoid slipping the robot exerts force on the walls. High torque motors are used in the construction to put maximum torque in order to nullify the condiition of backward motion. It uses spring force mechanism used in military under any attack.","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.700Z","created_at":"2021-08-03T18:18:26.776Z","updated_at":"2021-08-03T18:18:26.776Z","star":"A wall climbing robot that uses high torque motors and works on spring force mechanism."},{"id":4,"name":"Blaze-O-Rama","poster":"https://drive.google.com/file/d/1mUCtVIqLg0HCrP1AEq24GILI79oMTuzR/view?usp=sharing","description":"We are famous for our stage shows and the project is all \nabout it. We presented a dance show with special costumes and LED animated background.\nThe costumes and the backgrount were designed by our members which consisted\n of many led strips which was connected to the microcontroller. The strips were lighted up acording to the beats of music and the scene.","date":"11 April 2019","published_at":"2021-08-03T18:18:26.668Z","created_at":"2021-08-03T18:18:26.775Z","updated_at":"2021-08-03T18:18:26.775Z","star":"The famous stage show presented by microcontroller based special costumes and LED animated background."},{"id":5,"name":"Kaleidoscope","poster":"https://drive.google.com/file/d/1ykhVzYMr92AyJ6APZBEkfMLvDrAUjEQr/view?usp=sharing","description":"Have you ever thought about an object which displays the words you think? Sounds impossible right? But Microbird made this possible through their project Kaleidoscpe. Just think of any word or pattern and it's shown on a big screen the very next moment!  MICROBIRD presented a contemporary way to showcase one's imagination through its much-awaited project KALEIDOSCOPE: The Modern Display,changing the world from proposition to presentation.","date":"11,12,13 April 2019","published_at":"2021-08-03T18:18:26.733Z","created_at":"2021-08-03T18:18:26.776Z","updated_at":"2021-08-03T18:18:26.776Z","star":"A project that displays the words you think on a big LED screen."},{"id":6,"name":"LUMOSTANZA","poster":"https://drive.google.com/file/d/1KvzNKebbtVV4zNRJ2KJZrs6snwwMegE4/view?usp=sharing","description":"Lumostanza was a project in the main event of the fest held in \n2018. We are famous for our stage shows and the project is all \nabout it.We presented a dance show with special costumes.\nThe costumes were designed by our members which consisted\n of many led strips which was connected to the microcontroller. It was programmed in such a way that \nwhenever the change in the rhythm of the music was detected\n the LED strips used to change the colour.We performed on \nvarious songs and made it look like 'light is dancing'.","date":"12 April,2018","published_at":"2021-08-03T18:18:26.679Z","created_at":"2021-08-03T18:18:26.775Z","updated_at":"2021-08-03T18:18:26.775Z","star":"1st ever stage show of the University, where it looked like lights are performing instead of humans."},{"id":7,"name":"Smart parking system","poster":"https://drive.google.com/file/d/17VecWu9RWGx15hjYorSJYQlhnPhWLZKa/view?usp=sharing","description":"Traffic problems are the most prevailing problem out there in todays world which a drastic increase in the number of vehivles day by day . To solve this problem the smart parking system comes to the rescue. Through this system the users can easily identify and locate vacant spaces. This project also comes with a hassle free payment system. ","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.650Z","created_at":"2021-08-03T18:18:26.774Z","updated_at":"2021-08-03T18:18:26.774Z","star":"Dealing with the parking problem, this system locates a vacant parking space and makes the entree and exit convenient."},{"id":8,"name":"Smart Bin","poster":"https://drive.google.com/file/d/17-NNCYPaamiscgrKHedGAJrNJuzWOJoO/view?usp=sharing","description":"This project is based on the concept of ECOTRONICS, which means using electronics and technology in such a manner that they contribute to the conservation and development of the ecosystem. This bin is far more interesting than any bin out there ! it gives you goodies like wiif access, candies , mobile recharge all just in return of the garbage that you provide to it. It has 3 ultrasonic sensors on its upper part, which detects the influx of garbage and accordingly opens the lid.","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.691Z","created_at":"2021-08-03T18:18:26.775Z","updated_at":"2021-08-03T18:18:26.775Z","star":"An eco-friendly electronics bin that works using ultrasonic sensors and provides services like wifi, mobile charging, etc."},{"id":10,"name":"TOCHOMOJI","poster":"https://drive.google.com/file/d/1EEzMzFGOVlEq1zjMRlODLwtErOqizCx5/view?usp=sharing","description":"As the name suggests 'TochoMoji' means blend of\n technology and emojis.It was a fun project showcased\n in CULMYCA'18.The project was consisted of many\n emoticons and whenever an emoji was pressed a song \nrelated to the emoji was played.  We used simple arduino\n programming to do the task.","date":"17 Sept. ,2018","published_at":"2021-08-03T18:18:26.736Z","created_at":"2021-08-03T18:18:26.795Z","updated_at":"2021-08-03T18:18:26.795Z","star":"There were some technical emoticons which when pressed, plays music according to the expression."},{"id":11,"name":"Drawdio","poster":"https://drive.google.com/file/d/1jCV0b_cyKVNsY5FzACgB8-oD09yRp68a/view?usp=sharing","description":"This is a sim, the electronic sound synthesizer built on to the top of a pencil! The points are provided with a specific resistance based on which the drawdio plays sound tone with frequency of these resistances. When we hold drawdio in our hand our body becomes a part of the resisitve loop and you can do the fun tasks by yourself, such as drawing or playing a sound!","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.739Z","created_at":"2021-08-03T18:18:26.894Z","updated_at":"2021-08-03T18:18:26.894Z","star":"A sound synthesizer built onto a pencil that plays musical tone with varied frequencies."},{"id":12,"name":"Automatic irrigation system","poster":"https://drive.google.com/file/d/1CsNwcQMM6R95zq35ZbAyqWL-RATDjLYU/view?usp=sharing","description":"This is a project to ease the task of irrigation and take it to much advanced levels. The crops are automatically watered without the human assistance . Here we have used a mlisture sensor to detect the moisture levels of the soil. We have set a partiviular level for the moisture monitored, if the moisture level is less than the set level, pump automatically waters the soil and once the level is achieved, the motor is turned off. The motor is controlled using Arduino. It also contains servo motors which water at an angle to achieve irrigation perfectly.","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.742Z","created_at":"2021-08-03T18:18:26.894Z","updated_at":"2021-08-03T18:18:26.894Z","star":"Irrigation technique that uses moisture sensors and arduino to automatically water crops."},{"id":14,"name":" LASER PIANO","poster":"https://drive.google.com/file/d/1HbDOrhy83hERqhbTsMxFRhTKwJwRLnHZ/view?usp=sharing","description":" Laser Piano was a project in which we added technology in \nart of playing piano.It was operated through laser lights. It\n was completely a wireless project where the basic devices \nused were LASER LIGHTS, LDR SENSOR and some basic \nwires with a programmed arduino. Laser lights and LDR sensor \nwas placed opposite to each other. The circuit was designed in\n a way that till the time ldr is detecting light no current will flow\n and interrupting the path of laser with fingers lead to flow \ncurrent and musical sound was produced. So the light ray \nwas working as a key.\r\n","date":"12-14 April,2018","published_at":"2021-08-03T18:18:26.747Z","created_at":"2021-08-03T18:18:26.903Z","updated_at":"2021-08-03T18:18:26.903Z","star":"A wireless technology added piano that works using laser lights and LDRs programmed using arduino."},{"id":15,"name":"Robo Arm","poster":"https://drive.google.com/file/d/1qj2-W3zbR_CLVufUa4fJO9JMcIhG-xNy/view?usp=sharing","description":"As the name suggests Robo Arm is basically a designed arm of a robot much similar to a human arm and maybe even more complex than it due to a huge number of electronical components used for its proper functioning. It is usually programmable. These arms can act as complete setup in themselves by performing specific hand based tasks like drilling, welding, spinning, placement during assemblyor even tasks that can be dangerous to be performed by human hand in industries etc. The project had three prismatic joints whose axes were coincident with a cartesian coordinator.","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.750Z","created_at":"2021-08-03T18:18:26.904Z","updated_at":"2021-08-03T18:18:26.904Z","star":"Programmable arm of a robot that acts as complete setup to perform precarious works."},{"id":16,"name":"Whack Em All","poster":"https://drive.google.com/file/d/1gDijXoNaer2gPr0vD8xQXXtXOlbD2F-X/view?usp=sharing","description":"Have you spent on Arcades to play games? To your rescue, Microbird designed the classic frog and hammer game in an all new avatar using hall effect sensors and magnets! A project which was a great combo of technical knowledge and entertainment. Arduino was used to make random lights glow and when hit by magnetic hand lights turn off.","date":"11,12,13 April 2019","published_at":"2021-08-03T18:18:26.755Z","created_at":"2021-08-03T18:18:26.904Z","updated_at":"2021-08-03T18:18:26.904Z","star":"The classic frog and hammer game designed with hall effect sensors and magnets using arduino for controlling actions."},{"id":17,"name":"Makey Makey","poster":"https://drive.google.com/file/d/16JvmBZbpRiTo93y30OixwoHj87e7ZIQh/view?usp=sharing","description":"Makey Makey is an invention kit for the century where everyday objects , simple objects are turned into touchpads and are combined with the internet. This is useful for a huge variety of fields like art, engineering etc. This project works just like any other button by opening and closing the circuits accordingly the commands are sent to your computer.","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.787Z","created_at":"2021-08-03T18:18:26.904Z","updated_at":"2021-08-03T18:18:26.904Z","star":"An invention for creative people in which our own condutive objects are used for completing the circuit."},{"id":18,"name":"HOME AUTOMATION","poster":"https://drive.google.com/file/d/1y-DmoPzMMEoAAf86vckU_AyUpyKt8KdW/view?usp=sharing","description":"This project was made by some of our club members which\n was basically about controlling LED BULBS from our mobile\n phone only as well as from mannual switches. The main \nhardware that we used were- ESP32 Development Module,\n 4 channel relay, jumper wires, 4 switches, 4 Led Bulbs and\n a 5V adapter. We programmed the micro-controller to \nperform the task. To make it controllable from our mobile \nphones we used 'BLYNK' app and its cloud server. LED's\n could also be controlled by Google Assistant voice comma-\r\n -ands. For more details you can check complete video of \nthis project on our YOUTUBE channel.","date":"2 July,2021","published_at":"2021-08-03T18:18:26.753Z","created_at":"2021-08-03T18:18:26.904Z","updated_at":"2021-08-03T19:20:42.280Z","star":"To automate home appliances, we used hardware like ESP32 development module, relays, switches etc. that were controlled using BLYNK app."},{"id":19,"name":"Home Automation","poster":"https://drive.google.com/file/d/1y-DmoPzMMEoAAf86vckU_AyUpyKt8KdW/view?usp=sharing","description":"This is a totally useful project for today's internet controlled world! This was a model consisting a live room where we automated all the appliances such as fan, lights with the help of an Arduino and controlling them via a bluetooth module and using an app which takes commands from the user and perform the desired task!","date":"13 Oct 2016","published_at":"2021-08-03T18:18:26.758Z","created_at":"2021-08-03T18:18:26.904Z","updated_at":"2021-08-03T18:18:26.904Z","star":"A project to automate the appliances using an app with the hepl of microcontroller and bluetooth module."},{"id":3,"name":"Oximeter ","poster":"https://drive.google.com/file/d/1qGQ81DaNt1NClQz5uh0Zw1Hzcq-w4Cjx/view","description":"This was a project  when covid was at it's peak. We basically\n made a arduino controlled oximeter . The arduino was\n programmed to collect data from the sensor- MAX30100.The \nMAX30100 is an integrated pulse oximetry and heartrate \nmonitor sensor solution. When we put our finger on the sensor \nit gives output to the arduino. Results could easily be seen on \nserial monitor of arduino and on our mobile phone too. It was\n capable of measuring heart rate and level of oxygen in the\nbody.","date":"5 May 2021","published_at":"2021-08-03T18:18:26.620Z","created_at":"2021-08-03T18:18:26.774Z","updated_at":"2021-08-03T19:19:24.787Z","star":"Designed at peak covid times, this project was capable of measuring heart rate and oxygen level in the body."},{"id":9,"name":"Microworld","poster":"https://drive.google.com/file/d/1C9Hw7VNkTvUZUJtm3mt5Z68DuH_lw8ZR/view","description":"The self-designed mini-world, Microworld. The small world of electronics that only seemed small but had infinte boundaries. Microbird made this amazing project where machines foretell one's future, counsel  personality, finds a ghost near one and maybe give a piece of love advice. Main events in the above mentioned were Match Making and Personality Telling. Microbird made this possible by the modern technology and their tech knowledge. MicroWorld was an abode for technology.","date":"11, 12, 13 April 2019","published_at":"2021-08-03T18:18:26.685Z","created_at":"2021-08-03T18:18:26.775Z","updated_at":"2021-08-03T19:23:05.377Z","star":"A set of various fun- filled electronics projects like match making and personality telling."},{"id":13,"name":"Catch Em All","poster":"https://drive.google.com/file/d/16h8PPvDfUQviqbR5FQqT91xexhx-5xPQ/view?usp=sharing","description":" Microbird- The Techno club, brought a journey filled with nostalgia and amusement through its one of its most awaited Project Catch'em all. A project based on the famous pinball game of 90s, hardly to be found today anywhere. Set the ball rolling, crossing over all bumpers and ramps. Hurdles were made with different motors like servo motors, DC gear motors,etc. In it, a manually controlled robot capable of catching balls that falls after passing through hurdles in least time was made. ","date":"12, 13 April 2019","published_at":"2021-08-03T18:18:26.744Z","created_at":"2021-08-03T18:18:26.894Z","updated_at":"2021-08-03T18:18:26.894Z","star":"A project based on pinball game of 90s having a manually controlled robot and hurdles made using various motors."}]},"__N_SSG":true}